# Brew
tap 'homebrew/bundle'
tap 'homebrew/completions'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'homebrew/versions'

brew 'cmake'
brew 'readline'
brew 'ack'

brew 'bash'
brew 'bash-completion'
brew 'zsh'
brew 'zsh-completions'

brew 'git'
brew 'htop'
brew 'wget'
brew 'masscan'
brew 'nmap'
brew 'mitmproxy'
brew 'ssh-copy-id'

brew 'rbenv'
brew 'ruby-build'

brew 'nodenv'
brew 'node-build'
brew 'yarn'

brew 'phantomjs'

brew 'webp'
brew 'gifsicle'
brew 'ffmpeg', args: ['with-fontconfig', 'without-lame', 'without-qtkit', 'without-x264', 'without-xvid']
brew 'librsvg'
brew 'imagemagick', args: ['with-fontconfig', 'with-librsvg', 'with-webp']
brew 'libpng'
brew 'freetype'
brew 'fontconfig'
brew 'jpeg'
brew 'libtiff'

tap 'puma/puma'
brew 'puma/puma/puma-dev'

brew 'erlang'
brew 'elixir'

# MAS
brew 'mas'

mas '1Password', id: 443987910
mas 'Evernote', id: 406056744
mas 'Amphetamine', id: 937984704
mas 'Annotate', id: 918207447
mas 'Monosnap', id: 540348655
mas 'Sip', id: 507257563
mas 'Transmit', id: 403388562
mas 'Tweetbot', id: 557168941
mas 'iA Writer', id: 775737590
mas 'Keynote', id: 409183694
mas 'Slack', id: 803453959
mas 'Moom', id: 419330170
mas 'Cinch', id: 412529613
mas 'DaisyDisk', id: 411643860
mas 'Boom 2', id: 948176063
mas 'Pocket', id: 568494494
mas 'Crazy Tomato', id: 1105814268

# CASK
tap 'caskroom/cask'
brew 'brew-cask-completion'

cask 'alfred'
cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
cask 'blisk'
cask 'gpgtools'
cask 'imageoptim'
cask 'iterm2'
cask 'istat-menus'
cask 'bartender'
cask 'rescuetime'
cask 'pritunl'
cask 'dash'
cask 'postman'
cask 'tower'
cask 'spotify'
cask 'franz'
cask 'onyx'
cask 'recordit'
